In [227]:
import pandas as pd
import os

student_data = os.path.join('Resources', 'new_full_student_data.csv')
student_df = pd.read_csv(student_data)

In [228]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [229]:
#Deliverable 2: Prepare the Data

In [230]:
print(student_df.isnull().sum())

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [231]:
student_df = student_df.dropna()

In [232]:
print(student_df.isnull().sum())

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [233]:
student_df = student_df.drop_duplicates()

In [234]:
student_df = student_df.drop_duplicates(keep='first')

In [235]:
student_df = student_df.drop_duplicates(keep='last')

In [236]:
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [237]:
student_df["grade"] = student_df["grade"].str.replace("th", "")

In [238]:
student_df.grade

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [239]:
# Change the "grade" column to the int type
student_df["grade"] = student_df["grade"].astype(int)

In [240]:
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [241]:
# Generate the summary statistics for the student DataFrame
print(student_df.describe())

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [242]:
#Display the mean math score
math_mean = student_df["math_score"].mean()

In [243]:
print(math_mean)

64.67573326141189

In [244]:
#Store the minimum reading score in min_reading_score
min_reading_score = student_df["reading_score"].min()

In [245]:
print(min_reading_score)

10.5

In [246]:
#Display the grade column by using loc
grade_column = student_df.loc[:, "grade"]
print(grade_column)

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [247]:
#Display the first three rows of Columns 3, 4, and 5 by using iloc
first_three_rows = student_df.iloc[:3, [3,4,5]]
print(first_three_rows)

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [248]:
#Select the rows for Grade 9, and display their summary statistics by using loc and describe
grade_9 = student_df.loc[student_df["grade"] == 9]
print(grade_9.describe())

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [249]:
#Store the row with the minimum overall reading score in min_reading_row by using loc and the min_reading_score variable
min_reading_score = student_df["reading_score"].min()

In [250]:
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]

In [251]:
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [252]:
#Select all the reading scores from the 10th graders at Dixon High School by using loc with conditionals 
#.5
#need help in displaying as shown in Deliverable 4: Drill Down into the Data #
dixon_10th_graders = student_df.loc[(student_df["school_name"] == "Dixon High School") & (student_df["grade"] == 10), ["school_name","reading_score"]]
dixon_10th_graders

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [253]:
#Find the mean reading score for all the students in Grades 11 and 12 combined by using conditional statements and loc or iloc.
grade_11_12_df = student_df.loc[(student_df['grade'] == '11') | (student_df['grade'] == '12')]
mean_reading_score = grade_11_12_df['reading_score'].mean()
print("Mean reading score for Grades 11 and 12:", mean_reading_score)

Mean reading score for Grades 11 and 12: nan

In [254]:
#Display the average budget for each school type by using the groupby and mean functions
average_budget_by_school_type = student_df.groupby('school_type')['school_budget'].mean()
average_budget_by_school_type

school_type
Charter    872625.656236
Public     911195.558251
Name: school_budget, dtype: float64

In [255]:
#Find the total number of students at each school, and sort those numbers from largest to smallest by using the groupby, count, and sort_values functions
student_counts = student_df.groupby(['school_name']).size().reset_index(name='student_counts')
student_counts = student_counts.sort_values(by='student_counts', ascending=False)
print(student_counts)

               school_name  student_counts
7   Montgomery High School            2038
6        Green High School            1961
4        Dixon High School            1583
13      Wagner High School            1541
10       Silva High School            1109
14       Woods High School            1052
11    Sullivan High School             971
12      Turner High School             846
0       Bowers High School             803
5       Fisher High School             798
9      Richard High School             551
2       Campos High School             541
8     Odonnell High School             459
1     Campbell High School             407
3        Chang High School             171

In [259]:
avg_math_score_by_grade_school_type = student_df.groupby(['school_type', 'grade']).agg({'math_score': 'mean'})
avg_math_score_by_grade_school_type = avg_math_score_by_grade_school_type.round(0)
print(avg_math_score_by_grade_school_type)

                   math_score
school_type grade
Charter     9            70.0
            10           66.0
            11           68.0
            12           60.0
Public      9            64.0
            10           64.0
            11           59.0
            12           64.0

In [258]:
#Deliverable 6: Report Findings: brief summary of your findings
#It looks like the average math score for the charter schools are higher than public scools except grade 12. Scores for grage 12 are roughly the same
#It would be great if the reading scores are compared and analyzed for specific schools instead of school type.